"use strict";
const autoModel = [
  {
    id: "car1",
    title: "Lexus RX",
    img: "./img/RX1.png",
    text: "Оновлена версія RX зберегла властиву моделі потужність та спортивність. Водночас фірмовий силует, завдяки новим елементам, став ще більш ефектним, динамічним та елегантним. Нові вузькі основні фари надають передній частині автомобіля гостроти та індивідуальності. Крім цього, оновлений Lexus RX оснащується першою у світі системою адаптивного управління дальнім світлом типу BladeScan і комплексом систем безпеки Lexus Safety System + нового покоління.",
  },
  {
    id: "car2",
    title: "Lexus GX",
    img: "./img/GX1.png",
    text: "GX 460 з двигуном V8 дозволяє рухатися в будь-якому напрямку. Цей позашляховик протестований за найекстремальніших умов. Він оснащений десятьма подушками безпеки та новаторською системою Lexus Safety System +, що забезпечують неймовірний рівень безпеки. Усередині салону ви відчуєте високий рівень майстерності, та насолоджуватиметесь винятковими функціями, серед яких аудіосистема Mark Levinson з 17 динаміками та навігаційна система преміумкласу від Lexus.",
  },
  {
    id: "car3",
    title: "Lexus LX",
    img: "./img/LX1.png",
    text: "Премiфльна версія LX легко вміщує до 7 пасажирів, зберігаючи при цьому вишуканий зовнішній вигляд та забезпечуючи комфортне водіння. Пасажири третього ряду почуватимуться безпечно та комфортно завдяки таким опціям, як індивідуальна зона кондиціювання, оптимізовані бокові шторки безпеки та сидіння з електрорегулюванням.",
  },
  {
    id: "car4",
    title: "Lexus ES",
    img: "./img/ES1.png",
    text: "Шість поколінь Lexus ES досягли значного успіху в сегменті бізнес-седанів. Сьоме покоління моделі має більш амбітне завдання. Модель ES давно завоювала високі оцінки за комфорт, витонченість та розкіш. Нова платформа, на якій побудовано це покоління, не тільки покращує всі ці якості, вона також дозволила створити ще динамічніший та сміливий дизайн кузова, щоб керування автомобілем стало більш захопливим.",
  },
  {
    id: "car5",
    title: "Lexus LS",
    img: "./img/LS1.png",
    text: "Мінімалістичний, однак інтуїтивно зрозумілий продуманий простір поєднав матеріали преміальної якості та провідні технології для забезпечення високого рівня комфорту в салоні. Удосконалені передні сидіння забезпечують зручнішу посадку, а також чудову підтримку і обігрів/вентиляцію тіла. Можна обрати комплектацію зі шкіряним салоном без використання матеріалів тваринного походження.",
  },
];

const [startPage] = autoModel;
const mainContent = document.querySelector(".main");
const btnMenu = document
  .querySelector(".site-menu")
  .addEventListener("click", addContent);

function addContent({ target }) {
  if (target.id) {
    const content = autoModel.find((car) => car.id === target.id);
    mainContent.innerHTML = renderContent(content);
  }
}

function renderContent({ img, title, text }) {
  return `<img class="content-img" src="${img}" alt="" >
  <h2 class="content-title">${title}</h2>
        <p class="content-text">${text}</p>`;
}

window.addEventListener("DOMContentLoaded", () => {
  mainContent.innerHTML = renderContent(startPage);
});
